<details ><summary>plan for portal 2024-12-26 11:59:37 (UTC)</summary>
  <details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd_autopilot will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_autopilot" {
        id    = "560394116"
      ~ name  = "autopilot.portal-renterd-cluster.node.testing" -> "autopilot.portal-renterd-cluster-autopilot.node.testing"
        # (4 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_bus will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_bus" {
        id    = "560394040"
      ~ name  = "bus.portal-renterd-cluster.node.testing" -> "bus.portal-renterd-cluster-bus.node.testing"
      ~ value = "tn5k7h55il93na4f36ojpnp2l4.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_workers[0] will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_workers" {
        id    = "560394105"
      ~ name  = "worker-1.portal-renterd-cluster.node.testing" -> "worker-1.portal-renterd-cluster-worker.node.testing"
        # (4 unchanged attributes hidden)
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19447927:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388737:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388734:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>
</details>